tap 'homebrew/cask'
tap 'microsoft/git'

brew 'git'
brew 'volta'
brew 'node'
brew 'zsh'
brew 'zsh-completions'
brew 'kubectl'
brew 'java'
brew 'tmux'
brew 'gh'  # GitHub CLI
brew 'mas' # Mac App Store CLI

cask 'visual-studio-code'
cask 'git-credential-manager'
cask 'iterm2'
cask 'docker'
cask 'beyond-compare'
cask 'kreya'
cask 'redisinsight'