tap 'microsoft/git'
tap 'chainguard-dev/tap'
tap 'hashicorp/tap'

brew 'git'
brew 'volta'
brew 'node'
brew 'zsh'
brew 'zsh-completions'
brew 'kubectl'
brew 'helm'
brew 'helmfile'
brew 'java'
brew 'rustup'
brew 'tmux'
brew 'tree'
brew 'grpcurl'
brew 'awscli'
brew 'oras'
brew 'skaffold'
brew 'kustomize'
brew 'hashicorp/tap/terraform'
brew 'k9s'
brew 'chainctl'
brew 'cilium-cli'
brew 'gh'  # GitHub CLI
brew 'mas' # Mac App Store CLI
brew 'huseyinbabal/tap/taws' # Terminal AWS CLI wrapper

cask 'visual-studio-code'
cask 'git-credential-manager'
cask 'iterm2'
#cask 'docker' # I've installed manually for now
cask 'beyond-compare'
cask 'kreya'
cask 'redis-insight'
cask 'postman'
#cask 'warp'
cask 'openlens'
#cash 'powershell' # Will not be installed from homebrew soon, so download from https://github.com/MicrosoftDocs/PowerShell-Docs/blob/main/reference/docs-conceptual/install/install-powershell-on-macos.md#install-the-package-via-direct-download
