tap 'microsoft/git'

brew 'git'
brew 'volta'
brew 'node'
brew 'zsh'
brew 'zsh-completions'
brew 'kubectl'
brew 'helm'
brew 'helmfile'
brew 'java'
brew 'rustup'
brew 'tmux'
brew 'grpcurl'
brew 'awscli'
brew 'oras'
brew 'gh'  # GitHub CLI
brew 'mas' # Mac App Store CLI

cask 'visual-studio-code'
cask 'git-credential-manager'
cask 'iterm2'
#cask 'docker' # I've installed manually for now
cask 'beyond-compare'
cask 'kreya'
cask 'redis-insight'
cask 'postman'
cask 'warp'
cask 'openlens'